ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/SWM330_StdPeriph_Driver/SWM330_sdio.c
/*******************************************************************************************************************************
* @brief	SDIO driver
*
*
********************************************************************************************************************************
* @attention
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS WITH CODING INFORMATION 
* REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME. AS A RESULT, SYNWIT SHALL NOT BE HELD LIABLE 
* FOR ANY DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT 
* OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION CONTAINED HEREIN IN CONN-
* -ECTION WITH THEIR PRODUCTS.
*
* COPYRIGHT 2012 Synwit Technology 
*******************************************************************************************************************************/
#include "SWM330.h"
#include "SWM330_sdio.h"


/*  0: No software timeout, always query
 * >0: query times, after query SDIO_TIMEOUT times, return immediately without waiting
 */
#ifndef SDIO_TIMEOUT
#define SDIO_TIMEOUT  0
#endif


#define wait_while(condition, ...) {                     \
		for (uint32_t time = SDIO_TIMEOUT; condition;) { \
			if(SDIO_TIMEOUT && (--time == 0))	         \
				return SD_RES_TIMEOUT;			         \
            __VA_ARGS__                                  \
		}										         \
	}

#define SDIO_IT_MASK  0x13FF81FF //valid bit: [0~8], [15~25], 28

SD_CardInfo SD_cardInfo;


/*******************************************************************************************************************************
* @brief	SDIO init
* @param	freq is SDIO clock frequency to use
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
*******************************************************************************************************************************/
uint32_t SDIO_Init(uint32_t freq)
{
	uint32_t res;
	uint32_t resp, resps[4];
	
	SYS->CLKSEL &= ~SYS_CLKSEL_SDIO_Msk;
	if(SystemCoreClock > (104 * 1000 * 1000))		// SDIO clock frequency must be less than 52MHz
		SYS->CLKSEL |= (2 << SYS_CLKSEL_SDIO_Pos);	// SDCLK = SYSCLK / 4
	else
		SYS->CLKSEL |= (0 << SYS_CLKSEL_SDIO_Pos);	// SDCLK = SYSCLK / 2
	
	SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_SDIO_Pos);
	
	SDIO->CR2 = (1 << SDIO_CR2_RSTALL_Pos);
	
	SDIO->CR1 = (1 << SDIO_CR1_CDSRC_Pos) |
				(0 << SDIO_CR1_8BIT_Pos)  |
				(0 << SDIO_CR1_4BIT_Pos)  |
				(1 << SDIO_CR1_PWRON_Pos) |
				(7 << SDIO_CR1_VOLT_Pos);
	
	SDIO->CR2 = (1 << SDIO_CR2_CLKEN_Pos) |
				(1 << SDIO_CR2_SDCLKEN_Pos) |
				(calcSDCLKDiv(100000) << SDIO_CR2_SDCLKDIV_Pos) |
				(0xC << SDIO_CR2_TIMEOUT_Pos);		// 2**25 SDIO_CLK
	
	while((SDIO->CR2 & SDIO_CR2_CLKRDY_Msk) == 0);
	
	for(int i = 0; i < CyclesPerUs * 10; i++) __NOP();
	
	SDIO->IM |= SDIO_IT_MASK;
    SDIO_INTClr(SDIO_IT_MASK);
    SDIO_INTDis(SDIO_IT_MASK);
	
	SDIO_SendCmd(SD_CMD_GO_IDLE_STATE, 0x00, SD_RESP_NO, 0);				// CMD0: GO_IDLE_STATE
	SDIO_SendCmd(SD_CMD_GO_IDLE_STATE, 0x00, SD_RESP_NO, 0);
	
	res = SDIO_SendCmd(SD_CMD_SEND_IF_COND, 0x1AA, SD_RESP_32b, &resp);		// CMD8: SEND_IF_COND, check the operating voltage and whether SD 2.0 is supported
	if(res != SD_RES_OK)
		return res;		// voltage mismatch or Ver1.X SD Memory Card or not SD Memory Card 
	
	if(resp == 0x1AA) SD_cardInfo.CardType = SDIO_STD_CAPACITY_SD_CARD_V2_0;
	else			  return SD_RES_ERR;
	
	uint32_t timeout = 2000;	// SD_CLK 100KHz, 100 bits per CMD, 1000 CMDs per second
	do																		// ACMD41: SD_CMD_SD_APP_OP_COND
	{
		if(--timeout == 0)
			return SD_RES_ERR;
		
		res = SDIO_SendCmd(SD_CMD_APP_CMD, 0x00, SD_RESP_32b, &resp);
		if(res != SD_RES_OK)
			return res;
		
		if((resp & SD_CS_APP_CMD) == 0) return SD_RES_ERR;
		
		if(SD_cardInfo.CardType == SDIO_STD_CAPACITY_SD_CARD_V2_0)
			SDIO_SendCmd(SD_CMD_SD_APP_OP_COND, 0x80100000|0x40000000, SD_RESP_32b, &resp);
		else
			SDIO_SendCmd(SD_CMD_SD_APP_OP_COND, 0x80100000|0x00000000, SD_RESP_32b, &resp);
	} while(((resp >> 31) & 0x01) == 0);		// when the power-on is incomplete, resp[31] == 0
	
	if(((resp >> 30) & 0x01) == 1) SD_cardInfo.CardType = SDIO_HIGH_CAPACITY_SD_CARD;
	
	
	SDIO_SendCmd(SD_CMD_ALL_SEND_CID, 0x00, SD_RESP_128b, resps);			// CMD2: SD_CMD_ALL_SEND_CID, get CID
	
	parseCID(resps);
	
	
	SDIO_SendCmd(SD_CMD_SET_REL_ADDR, 0x00, SD_RESP_32b, &resp);			// CMD3: SD_CMD_SET_REL_ADDR, set RCA
	
	SD_cardInfo.RCA = resp >> 16;
	
	
	SDIO_SendCmd(SD_CMD_SEND_CSD, SD_cardInfo.RCA << 16, SD_RESP_128b, resps);	// CMD9: SD_CMD_SEND_CSD, set CSD
	
	parseCSD(resps);
	
	if(SD_cardInfo.CardBlockSize < 0x200) return SD_RES_ERR;	// The driver supports read and write in 512 bytes only.
	
	SDIO_SendCmd(SD_CMD_SEL_DESEL_CARD, SD_cardInfo.RCA << 16, SD_RESP_32b_busy, &resp);	// CMD7: Select the card and enter the Transfer mode from Standy mode
    
    /* >25MHz switch high speed */
    if (freq > 25 * 1000 * 1000) {
        res = SDIO_HighSpeed();
        if (SD_RES_OK != res) {
            return res;
        }
    }
    
	SDIO->CR2 &= ~(SDIO_CR2_SDCLKEN_Msk | SDIO_CR2_SDCLKDIV_Msk | SDIO_CR2_CLKEN_Msk | SDIO_CR2_CLKRDY_Msk);
	SDIO->CR2 |= (1 << SDIO_CR2_SDCLKEN_Pos) | SDIO_CR2_CLKEN_Msk |
				 (calcSDCLKDiv(freq) << SDIO_CR2_SDCLKDIV_Pos);	// Initialization is complete and SDCLK switches to high speed
	
	while((SDIO->CR2 & SDIO_CR2_CLKRDY_Msk) == 0) {}
	
	SDIO_SendCmd(SD_CMD_APP_CMD, SD_cardInfo.RCA << 16, SD_RESP_32b, &resp);
	
	SDIO_SendCmd(SD_CMD_APP_SD_SET_BUSWIDTH, SD_BUSWIDTH_4b, SD_RESP_32b, &resp);	// Switch to 4-bit bus mode
	
	SDIO->CR1 |= (1 << SDIO_CR1_4BIT_Pos);
	
	
	SDIO_SendCmd(SD_CMD_SET_BLOCKLEN, 512, SD_RESP_32b, &resp);		// Fixed block size bit 512 bytes
	
	SD_cardInfo.CardBlockSize = 512;
	
	SDIO->BLK = 512;
	
	return SD_RES_OK;
}

/*******************************************************************************************************************************
* @brief	SDIO write multiple blocks to sdcard, 512 bytes per block
* @param	block_addr is sdcard block address to write to
* @param	block_cnt is block count to write
* @param	buff is data to write to sdcard
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
*******************************************************************************************************************************/
uint32_t SDIO_MultiBlockWrite(uint32_t block_addr, uint16_t block_cnt, uint32_t buff[])
{
	uint32_t res, i, j;
	uint32_t addr, resp;
	
	if(SD_cardInfo.CardType == SDIO_HIGH_CAPACITY_SD_CARD)	addr = block_addr;
	else													addr = block_addr * 512;
	
	res = SDIO_SendCmdWithData((block_cnt > 1) ? SD_CMD_WRITE_MULT_BLOCK : SD_CMD_WRITE_SINGLE_BLOCK, addr, SD_RESP_32b, &resp, 0, block_cnt);
	if(res != SD_RES_OK)
		return res;
	
