ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/SWM330_StdPeriph_Driver/SWM330_sdio.c
	for(i = 0; i < block_cnt; i++)
	{
		wait_while(!SDIO_INTStat(SDIO_IT_BUFWRRDY));
		SDIO_INTClr(SDIO_IT_BUFWRRDY);
		
		for(j = 0; j < 512/4; j++) SDIO->DATA = buff[i*(512/4) + j];
	}
	
	wait_while(!SDIO_INTStat(SDIO_IT_TRXDONE));
	SDIO_INTClr(SDIO_IT_TRXDONE);
	
	return SD_RES_OK;
}

/*******************************************************************************************************************************
* @brief	SDIO write multiple blocks to sdcard by DMA, 512 bytes per block
* @param	block_addr is sdcard block address to write to
* @param	block_cnt is block count to write
* @param	buff is data to write to sdcard
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
*******************************************************************************************************************************/
uint32_t SDIO_DMABlockWrite(uint32_t block_addr, uint16_t block_cnt, uint32_t buff[])
{
	uint32_t res;
	uint32_t addr, resp;
	
	if(SD_cardInfo.CardType == SDIO_HIGH_CAPACITY_SD_CARD)	addr = block_addr;
	else													addr = block_addr * 512;
	
	SDIO->DMA_MEM_ADDR = (uint32_t) buff;
	
	res = SDIO_SendCmdWithDataByDMA((block_cnt > 1) ? SD_CMD_WRITE_MULT_BLOCK : SD_CMD_WRITE_SINGLE_BLOCK, addr, SD_RESP_32b, &resp, 0, block_cnt);
	if(res != SD_RES_OK)
		return res;
	
    wait_while(!SDIO_INTStat(SDIO_IT_TRXDONE), 
                    if (SDIO_INTStat(SDIO_IT_DMADONE)) { 
                        SDIO_INTClr(SDIO_IT_DMADONE);
                        SDIO->DMA_MEM_ADDR = SDIO->DMA_MEM_ADDR;
                    }
               );
	SDIO_INTClr(SDIO_IT_TRXDONE | SDIO_IT_DMADONE);
	
	return SD_RES_OK;
}

/*******************************************************************************************************************************
* @brief	SDIO read multiple blocks from sdcard, 512 bytes per block
* @param	block_addr is sdcard block address to read from
* @param	block_cnt is block count to read
* @param	buff is used to save the read data
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
*******************************************************************************************************************************/
uint32_t SDIO_MultiBlockRead(uint32_t block_addr, uint16_t block_cnt, uint32_t buff[])
{
	uint32_t res, i, j;
    uint32_t addr, resp;
	
	if(SD_cardInfo.CardType == SDIO_HIGH_CAPACITY_SD_CARD)	addr = block_addr;
	else													addr = block_addr * 512;
	
	res = SDIO_SendCmdWithData((block_cnt > 1) ? SD_CMD_READ_MULT_BLOCK : SD_CMD_READ_SINGLE_BLOCK, addr, SD_RESP_32b, &resp, 1, block_cnt);
	if(res != SD_RES_OK)
		return res;
	
	for(i = 0; i < block_cnt; i++)
	{
		wait_while(!SDIO_INTStat(SDIO_IT_BUFRDRDY));
		SDIO_INTClr(SDIO_IT_BUFRDRDY);
		
		for(j = 0; j < 512/4; j++) buff[i*(512/4) + j] = SDIO->DATA;
	}
	
	wait_while(!SDIO_INTStat(SDIO_IT_TRXDONE));
	SDIO_INTClr(SDIO_IT_TRXDONE);
	
	return SD_RES_OK;
}

/*******************************************************************************************************************************
* @brief	SDIO read multiple blocks from sdcard by DMA, 512 bytes per block
* @param	block_addr is sdcard block address to read from
* @param	block_cnt is block count to read
* @param	buff is used to save the read data
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
*******************************************************************************************************************************/
uint32_t SDIO_DMABlockRead(uint32_t block_addr, uint16_t block_cnt, uint32_t buff[])
{
	uint32_t res;
    uint32_t addr, resp;
	
	if(SD_cardInfo.CardType == SDIO_HIGH_CAPACITY_SD_CARD)	addr = block_addr;
	else													addr = block_addr * 512;
	
	SDIO->DMA_MEM_ADDR = (uint32_t)buff;
	
	res = SDIO_SendCmdWithDataByDMA((block_cnt > 1) ? SD_CMD_READ_MULT_BLOCK : SD_CMD_READ_SINGLE_BLOCK, addr, SD_RESP_32b, &resp, 1, block_cnt);
	if(res != SD_RES_OK)
		return res;
	
    wait_while(!SDIO_INTStat(SDIO_IT_TRXDONE), 
                    if (SDIO_INTStat(SDIO_IT_DMADONE)) { 
                        SDIO_INTClr(SDIO_IT_DMADONE);
                        SDIO->DMA_MEM_ADDR = SDIO->DMA_MEM_ADDR;
                    }
               );
	SDIO_INTClr(SDIO_IT_TRXDONE | SDIO_IT_DMADONE);
	return SD_RES_OK;
}

/*******************************************************************************************************************************
* @brief	SDIO send command to sdcard
* @param	cmd is command to send
* @param	arg is command argument
* @param	resp_type is response type for the command, can be SD_RESP_NO, SD_RESP_32b, SD_RESP_128b and SD_RESP_32b_busy
* @param	have_data indicates whether the command has data phase
* @param	data_read indicates data phase direction, 1 read sdcard, 0 write sdcard
* @param	block_cnt is block count to read/write
* @param	use_dma indicates whether the data phsase use DMA
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
*******************************************************************************************************************************/
uint32_t _SDIO_SendCmd(uint32_t cmd, uint32_t arg, uint32_t resp_type, uint32_t *resp_data, uint32_t have_data, uint32_t data_read, uint16_t block_cnt, uint32_t use_dma)
{
    cmd &= (SDIO_CMD_CMDINDX_Msk >> SDIO_CMD_CMDINDX_Pos);
    
	SDIO->BLK &= ~(SDIO_BLK_COUNT_Msk | SDIO_BLK_DMA_SIZE_Msk);
	SDIO->BLK |= (block_cnt << SDIO_BLK_COUNT_Pos) | (0 << SDIO_BLK_DMA_SIZE_Pos); 
	
	SDIO->ARG = arg;
	SDIO->CMD = (cmd             << SDIO_CMD_CMDINDX_Pos)   |
				(0               << SDIO_CMD_CMDTYPE_Pos)   |
				(0               << SDIO_CMD_IDXCHECK_Pos)  |
				(0               << SDIO_CMD_CRCCHECK_Pos)  |
				(resp_type       << SDIO_CMD_RESPTYPE_Pos)  |
				(have_data       << SDIO_CMD_HAVEDATA_Pos)  |
				(data_read       << SDIO_CMD_DIRREAD_Pos)   |
				((block_cnt > 1) << SDIO_CMD_MULTBLK_Pos)   |
				((block_cnt > 1) << SDIO_CMD_BLKCNTEN_Pos)  |
				(((cmd == 53) ? 0 : (block_cnt > 1)) << SDIO_CMD_AUTOCMD12_Pos) |
				(use_dma         << SDIO_CMD_DMAEN_Pos);
	
	while(!SDIO_INTStat(SDIO_IT_CMDDONE))
	{
		if(SDIO_INTStat(SDIO_IT_ERR_CMDTIMEOUT))
		{
			SDIO_INTClr(SDIO_IT_ERR_CMDTIMEOUT);
			
