ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/SWM330_StdPeriph_Driver/SWM330_sdio.c
	/*!< Byte 13 */
	tmp = (uint8_t)((CSD_Tab[3] & 0x00FF0000) >> 16);
	SD_cardInfo.SD_csd.MaxWrBlockLen |= (tmp & 0xC0) >> 6;
	SD_cardInfo.SD_csd.WriteBlockPaPartial = (tmp & 0x20) >> 5;
	SD_cardInfo.SD_csd.Reserved3 = 0;
	SD_cardInfo.SD_csd.ContentProtectAppli = (tmp & 0x01);
	
	/*!< Byte 14 */
	tmp = (uint8_t)((CSD_Tab[3] & 0x0000FF00) >> 8);
	SD_cardInfo.SD_csd.FileFormatGrouop = (tmp & 0x80) >> 7;
	SD_cardInfo.SD_csd.CopyFlag = (tmp & 0x40) >> 6;
	SD_cardInfo.SD_csd.PermWrProtect = (tmp & 0x20) >> 5;
	SD_cardInfo.SD_csd.TempWrProtect = (tmp & 0x10) >> 4;
	SD_cardInfo.SD_csd.FileFormat = (tmp & 0x0C) >> 2;
	SD_cardInfo.SD_csd.ECC = (tmp & 0x03);
}

/*******************************************************************************************************************************
* @brief	calculate clock divider to get expected SDIO clock frequency
* @param	freq is expected SDIO clock frequency
* @return	division
*******************************************************************************************************************************/
uint32_t calcSDCLKDiv(uint32_t freq)
{
	uint32_t prediv;
	switch((SYS->CLKSEL & SYS_CLKSEL_SDIO_Msk) >> SYS_CLKSEL_SDIO_Pos)
	{
	case 0: prediv = 1; break;
	case 1: prediv = 3; break;
	case 2: prediv = 2; break;
	case 3: prediv = 0; break;
	}
	
	uint32_t clkdiv = (SystemCoreClock / (1 << prediv)) / freq;
	uint32_t regdiv = 0;
	
	if(clkdiv > 128)     regdiv = 0x80;
	else if(clkdiv > 64) regdiv = 0x40;
	else if(clkdiv > 32) regdiv = 0x20;
	else if(clkdiv > 16) regdiv = 0x10;
	else if(clkdiv >  8) regdiv = 0x08;
	else if(clkdiv >  4) regdiv = 0x04;
	else if(clkdiv >  2) regdiv = 0x02;
	else if(clkdiv >  1) regdiv = 0x01;
	else                 regdiv = 0x00;
	
	return regdiv;
}

/*******************************************************************************************************************************
* @brief	Switch mode High-Speed
* @param
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
* @note		This function must be used after "Transfer State"
*******************************************************************************************************************************/
uint32_t SDIO_HighSpeed(void)
{
	uint32_t res, resp;
	uint32_t buff[512/8/4];
	
	SDIO->BLK = 512 / 8;	// 512 bits of status
	
	res = SDIO_SendCmdWithData(SD_CMD_HS_SWITCH, 0x80FFFF01, SD_RESP_32b, &resp, 1, 1);
	if(res != SD_RES_OK)
		return res;
	
    wait_while(!SDIO_INTStat(SDIO_IT_BUFRDRDY));
	SDIO_INTClr(SDIO_IT_BUFRDRDY);
    
    for(int i = 0; i < 512/8/4; i++) buff[i] = SDIO->DATA;
    
	wait_while(!SDIO_INTStat(SDIO_IT_TRXDONE));
	SDIO_INTClr(SDIO_IT_TRXDONE);
	
	if((buff[4] & 0xF) != 1)
		return SD_RES_ERR;
	
	return SD_RES_OK;
}


/*******************************************************************************************************************************
* @brief	SDIO init for read/write IO card
* @param	freq is SDIO clock frequency to use
* @param	w is SDIO bus width to use, can be SDIO_1bit and SDIO_4bit
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
*******************************************************************************************************************************/
uint32_t SDIO_IO_Init(uint32_t freq, enum SDIO_bus_width w)
{
	uint32_t res;
	uint32_t resp, resps[4];
	
	SYS->CLKSEL &= ~SYS_CLKSEL_SDIO_Msk;
	if(SystemCoreClock > (104 * 1000 * 1000))		// SDIO clock frequency must be less than 52MHz
		SYS->CLKSEL |= (2 << SYS_CLKSEL_SDIO_Pos);	// SDCLK = SYSCLK / 4
	else
		SYS->CLKSEL |= (0 << SYS_CLKSEL_SDIO_Pos);	// SDCLK = SYSCLK / 2
	
	SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_SDIO_Pos);
	
//	SDIO->CR2 = (1 << SDIO_CR2_RSTALL_Pos);
	for(int i = 0; i < CyclesPerUs; i++) __NOP();
	
	SDIO->CR1 = (1 << SDIO_CR1_CDSRC_Pos) |
				(0 << SDIO_CR1_8BIT_Pos)  |
				(w << SDIO_CR1_4BIT_Pos)  |
				(1 << SDIO_CR1_PWRON_Pos) |
				(7 << SDIO_CR1_VOLT_Pos);
	
	SDIO->CR2 = (1 << SDIO_CR2_CLKEN_Pos) |
				(1 << SDIO_CR2_SDCLKEN_Pos) |
				(calcSDCLKDiv(freq) << SDIO_CR2_SDCLKDIV_Pos) |
				(0xC << SDIO_CR2_TIMEOUT_Pos);		// 2**25 SDIO_CLK
	
	while((SDIO->CR2 & SDIO_CR2_CLKRDY_Msk) == 0);
	
	for(int i = 0; i < CyclesPerUs * 10; i++) __NOP();
	
	SDIO->IM |= SDIO_IT_MASK;
	
	return SD_RES_OK;
}

/*******************************************************************************************************************************
* @brief	SDIO write single byte to IO card
* @param	func is the number of the function within the I/O card you wish to read or write
* @param	addr is start address of I/O register to read or write. range is 0--0x1FFFF
* @param	data is the data to write to IO card
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
*******************************************************************************************************************************/
uint32_t SDIO_IO_ByteWrite(uint8_t func, uint32_t addr, uint8_t data)
{
	uint32_t res;
	uint32_t arg, resp;
	
	arg = (1u  	<< SD_CMD53_ARG_nRW) |
		  (func	<< SD_CMD53_ARG_Function) |
		  (addr	<< SD_CMD53_ARG_Addr) | data;
	
	res = SDIO_SendCmd(52, arg, SD_RESP_32b, &resp);
	if(res != SD_RES_OK)
		return res;
	
	return SD_RES_OK;
}

/*******************************************************************************************************************************
* @brief	SDIO read single byte from IO card
* @param	func is the number of the function within the I/O card you wish to read or write
* @param	addr is start address of I/O register to read or write. range is 0--0x1FFFF
* @param	data is used to save the read data
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
*******************************************************************************************************************************/
uint32_t SDIO_IO_ByteRead(uint8_t func, uint32_t addr, uint8_t * data)
{
	uint32_t res;
    uint32_t arg, resp;
	
	arg = (0u  	<< SD_CMD53_ARG_nRW) |
		  (func	<< SD_CMD53_ARG_Function) |
		  (addr	<< SD_CMD53_ARG_Addr) | 0x00;
	
	res = SDIO_SendCmd(52, arg, SD_RESP_32b, &resp);
	if(res != SD_RES_OK)
		return res;
	
