ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/SWM330_StdPeriph_Driver/SWM330_sdio.c
    *data = resp & 0xFF;
	
	return SD_RES_OK;
}

/*******************************************************************************************************************************
* @brief	SDIO write single block to IO card
* @param	func is the number of the function within the I/O card you wish to read or write
* @param	addr is start address of I/O register to read or write. range is 0--0x1FFFF
* @param	addrInc: 0 Multi byte R/W to fixed address, 1 Multi byte R/W to incrementing address
* @param	buff is the data to write to IO card
* @param	block_size is the number of bytes to write, can be 1--512
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
*******************************************************************************************************************************/
uint32_t SDIO_IO_BlockWrite(uint8_t func, uint32_t addr, uint8_t addrInc, uint32_t buff[], uint16_t block_size)
{
	uint32_t res, i;
	uint32_t arg, resp;
	
	SDIO->BLK = block_size;
	
	arg = (1u      				<< SD_CMD53_ARG_nRW) |
		  (func    				<< SD_CMD53_ARG_Function) |
		  (addr    				<< SD_CMD53_ARG_Addr) |
		  (addrInc 				<< SD_CMD53_ARG_AddrInc) |
		  ((block_size % 512)	<< SD_CMD53_ARG_Count) |
		  (0       				<< SD_CMD53_ARG_CountUnit);
	
	res = SDIO_SendCmdWithData(53, arg, SD_RESP_32b, &resp, 0, 1);
	if(res != SD_RES_OK)
		return res;
	
    wait_while(!SDIO_INTStat(SDIO_IT_BUFWRRDY));
    SDIO_INTClr(SDIO_IT_BUFWRRDY);		
    
    for(i = 0; i < block_size/4; i++) SDIO->DATA = buff[i];
	
    wait_while(!SDIO_INTStat(SDIO_IT_TRXDONE));
	SDIO_INTClr(SDIO_IT_TRXDONE);
	
	return SD_RES_OK;
}

/*******************************************************************************************************************************
* @brief	SDIO read single block from IO card
* @param	func is the number of the function within the I/O card you wish to read or write
* @param	addr is start address of I/O register to read or write. range is 0--0x1FFFF
* @param	addrInc: 0 Multi byte R/W to fixed address, 1 Multi byte R/W to incrementing address
* @param	buff is used to save the read data
* @param	block_size is the number of bytes to read, can be 1--512
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
*******************************************************************************************************************************/
uint32_t SDIO_IO_BlockRead(uint8_t func, uint32_t addr, uint8_t addrInc, uint32_t buff[], uint16_t block_size)
{
	uint32_t res, i;
    uint32_t arg, resp;
	
	SDIO->BLK = block_size;
	
	arg = (0u      				<< SD_CMD53_ARG_nRW) |
		  (func    				<< SD_CMD53_ARG_Function) |
		  (addr    				<< SD_CMD53_ARG_Addr) |
		  (addrInc 				<< SD_CMD53_ARG_AddrInc) |
		  ((block_size % 512)	<< SD_CMD53_ARG_Count) |
		  (0       				<< SD_CMD53_ARG_CountUnit);
	
	res = SDIO_SendCmdWithData(53, arg, SD_RESP_32b, &resp, 1, 1);
	if(res != SD_RES_OK)
		return res;
	
    wait_while(!SDIO_INTStat(SDIO_IT_BUFRDRDY));
	SDIO_INTClr(SDIO_IT_BUFRDRDY);
    
    for(i = 0; i < block_size/4; i++) buff[i] = SDIO->DATA;
    
	wait_while(!SDIO_INTStat(SDIO_IT_TRXDONE));
	SDIO_INTClr(SDIO_IT_TRXDONE);
	
	return SD_RES_OK;
}

/*******************************************************************************************************************************
* @brief	SDIO write multiple blocks to IO card
* @param	func is the number of the function within the I/O card you wish to read or write
* @param	addr is start address of I/O register to read or write. range is 0--0x1FFFF
* @param	addrInc: 0 Multi byte R/W to fixed address, 1 Multi byte R/W to incrementing address
* @param	buff is the data to write to IO card
* @param	block_count is block count to write, 512 bytes per block
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
*******************************************************************************************************************************/
uint32_t SDIO_IO_MultiBlockWrite(uint8_t func, uint32_t addr, uint8_t addrInc, uint32_t buff[], uint16_t block_count)
{
	uint32_t res, i, j;
	uint32_t arg, resp;
	
	SDIO->BLK = 512;
	
	arg = (1u			<< SD_CMD53_ARG_nRW) |
		  (func			<< SD_CMD53_ARG_Function) |
		  (addr			<< SD_CMD53_ARG_Addr) |
		  (addrInc		<< SD_CMD53_ARG_AddrInc) |
		  (block_count	<< SD_CMD53_ARG_Count) |
		  (1			<< SD_CMD53_ARG_CountUnit);
	
	res = SDIO_SendCmdWithData(53, arg, SD_RESP_32b, &resp, 0, block_count);
	if(res != SD_RES_OK)
		return res;
	
	for(i = 0; i < block_count; i++)
	{
		wait_while(!SDIO_INTStat(SDIO_IT_BUFWRRDY));
		SDIO_INTClr(SDIO_IT_BUFWRRDY);
		
		for(j = 0; j < 512/4; j++) SDIO->DATA = buff[i*(512/4) + j];
	}
	
    wait_while(!SDIO_INTStat(SDIO_IT_TRXDONE));
	SDIO_INTClr(SDIO_IT_TRXDONE);
	
	return SD_RES_OK;
}

/*******************************************************************************************************************************
* @brief	SDIO read multiple blocks from IO card
* @param	func is the number of the function within the I/O card you wish to read or write
* @param	addr is start address of I/O register to read or write. range is 0--0x1FFFF
* @param	addrInc: 0 Multi byte R/W to fixed address, 1 Multi byte R/W to incrementing address
* @param	buff is used to save the read data
* @param	block_count is block count to read, 512 bytes per block
* @return	SD_RES_OK, SD_RES_ERR, SD_RES_TIMEOUT
*******************************************************************************************************************************/
uint32_t SDIO_IO_MultiBlockRead(uint8_t func, uint32_t addr, uint8_t addrInc, uint32_t buff[], uint16_t block_count)
{
	uint32_t res, i, j;
    uint32_t arg, resp;
	
	SDIO->BLK = 512;
	
	arg = (0u      		<< SD_CMD53_ARG_nRW) |
		  (func    		<< SD_CMD53_ARG_Function) |
		  (addr    		<< SD_CMD53_ARG_Addr) |
		  (addrInc 		<< SD_CMD53_ARG_AddrInc) |
		  (block_count	<< SD_CMD53_ARG_Count) |
		  (1       		<< SD_CMD53_ARG_CountUnit);
	
	res = SDIO_SendCmdWithData(53, arg, SD_RESP_32b, &resp, 1, block_count);
	if(res != SD_RES_OK)
		return res;
	
	for(i = 0; i < block_count; i++)
	{
		wait_while(!SDIO_INTStat(SDIO_IT_BUFRDRDY));
		SDIO_INTClr(SDIO_IT_BUFRDRDY);
		
		for(j = 0; j < 512/4; j++) buff[i*(512/4) + j] = SDIO->DATA;
	}
    
	wait_while(!SDIO_INTStat(SDIO_IT_TRXDONE));
	SDIO_INTClr(SDIO_IT_TRXDONE);
	
	return SD_RES_OK;
}

void SDIO_INTEn(uint32_t it)
{
    SDIO->IE |= it;
}

void SDIO_INTDis(uint32_t it)
{
    SDIO->IE &= ~it;
}

void SDIO_INTClr(uint32_t it)
{
    SDIO->IF |= it;
}

uint32_t SDIO_INTStat(uint32_t it)
{
    return SDIO->IF & it;
}
